[{"title": "Sony investment will put AI chips inside Raspberry Pi boards", "description": "Sony's semiconductor division has announced that it's making a \"strategic investment\" in Raspberry Pi as a way to bring its AI tech to a wider market. The idea is to give Raspberry Pi users around the world a development platform for its Aitrios edge computin…", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/YnwFCW5yh1_lBnS_nZcXFg--~B/Zmk9ZmlsbDtoPTYzMDtweW9mZj0wO3c9MTIwMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2023-04/9187f130-d906-11ed-bfff-437ef0360c42.cf.jpg"}, {"title": "Learn Python programming this spring with this bundle of coding courses, now only $24", "description": "We thank our sponsor for making this content possible; it is not written by the editorial staff nor does it necessarily reflect its views.\n\n\n\nLearning to code is one of the most lucrative skills we can master in an ever-evolving, high-tech world. — Read the r…", "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2023/03/Python.jpeg?fit=1200%2C800&ssl=1"}, {"title": "Friend or foe: Can computer coders trust ChatGPT?", "description": "The artificial intelligence ChatGPT can write computer code, but its help comes with many potential problems.", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/1B04/production/_129161960_matthewhunt.jpg"}, {"title": "Google Bard is switching to a more 'capable' language model, CEO confirms", "description": "People haven't exactly been impressed in the short time since Google released its \"experimental conversational AI service\" Bard. Coming up against OpenAI's ChatGPT and Microsoft's Bing Chat (also powered by OpenAI's GPT-4) users have found its responses to no…", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/GzD2s5OjayTYOmSWIjU2GQ--~B/Zmk9ZmlsbDtoPTYzMDtweW9mZj0wO3c9MTIwMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2023-03/1f60f730-c80a-11ed-b5e4-035524a36a2f.cf.jpg"}, {"title": "Is hand coding becoming obsolete?", "description": "Is hand coding becoming a thing of the past?", "urlToImage": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fdd063af7-a6f2-40cb-b975-f4710fa285d5_399x276.png"}, {"title": "The Hacking of ChatGPT Is Just Getting Started", "description": "Security researchers are jailbreaking large language models to get around safety rules. Things could get much worse.", "urlToImage": "https://media.wired.com/photos/64382842974961ad154a7977/191:100/w_1280,c_limit/security_jailbreaking_chatgpt_ai.jpg"}, {"title": "NSA Cybersecurity Director Says ‘Buckle Up’ for Generative AI", "description": "The security issues raised by ChatGPT and similar tech are just beginning to emerge, but Rob Joyce says it's time to prepare for what comes next.", "urlToImage": "https://media.wired.com/photos/644a7dfee416fd283a85c162/191:100/w_1280,c_limit/nsa_sec_GettyImages-1059275390.jpg"}, {"title": "The problems with live coding interviews", "description": "A quick exploration of the weaknesses of being over-reliant on live coding interviews.", "urlToImage": null}, {"title": "What’s AGI, and Why Are AI Experts Skeptical?", "description": "ChatGPT and other bots have revived conversations on artificial general intelligence. Scientists say algorithms won’t surpass you any time soon.", "urlToImage": "https://media.wired.com/photos/644051ca78b1686b7e2ea1bf/191:100/w_1280,c_limit/Scientists-Are-Sketpical-Of-AGI-Business-499295092.jpg"}, {"title": "Tables no longer needed for HTML email", "description": "Coding email like it's 2023", "urlToImage": "https://fullystacked.net/assets/email.png"}, {"title": "Show HN: Tabby – A Self-Hosted GitHub Copilot", "description": "Self-hosted AI coding assistant. Contribute to TabbyML/tabby development by creating an account on GitHub.", "urlToImage": "https://opengraph.githubassets.com/ba51f4bcbef367abcf7b27a8e1a6574afd904ba63686e879d3e18ff92a3d1392/TabbyML/tabby"}, {"title": "More than one in six TransPennine Express trains cancelled in March", "description": "Data from regulator shows TPE was worst-performing rail operator in UK, with almost 1,000 trains cancelledMore than one in six TransPennine Express trains were cancelled in March, according to data from the rail regulator, the worst performance of any rail op…", "urlToImage": "https://i.guim.co.uk/img/media/c7cd4690069a9e303c04cb5a92d9693eff6607ac/0_61_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9bac589811e919888349335d2ac8b018"}, {"title": "Fresh concerns raised over sources of training material for AI systems", "description": "Investigations reveal limited efforts to ‘clean’ datasets of fascist, pirated and malicious materialFresh fears have been raised about the training material used for some of the largest and most powerful artificial intelligence models, after several investiga…", "urlToImage": "https://i.guim.co.uk/img/media/711d23299fbf12f0c07d90a1994e1b1d8508aad2/0_284_8500_5103/master/8500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cf00ac46ba114d026bd771f6743588da"}, {"title": "Left 4 Dead 3 references found in Counter-Strike files", "description": "Counter-Strike 2, an update/overhaul/Overwatch-style sorta-sequel to Valve's beloved lootbox simulator masquerading as a shooter, may represent the future of the company in more ways than one. A Reddit user has discovered some very interesting keywords hidden…", "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2016/01/left4dead2linux.jpg?fit=530%2C273&ssl=1"}, {"title": "How to Become a “Designer Who Codes”", "description": "Quick note: “coding” in this article is my shorthand phrase for “learning enough HTML and CSS to be able to create the basic front-end for the websites you design.” Many developers will probably see…", "urlToImage": "https://miro.medium.com/v2/resize:fit:1200/1*59VN0ESUK8xS46kEyK0-lw.jpeg"}, {"title": "Amazon Makes a Push for More AI Coming Your Way - CNET", "description": "The company says new AI applications will help transform users' experiences.", "urlToImage": "https://www.cnet.com/a/img/resize/a9aba312927d39afbb6473945e0e4d8a3e26e0fa/hub/2023/04/13/b9f94645-3756-436e-8921-24e4311971e9/gettyimages-1248184642.jpg?auto=webp&fit=crop&height=630&width=1200"}, {"title": "Sserangecoding: Fast vectorized (SSE 4.1) range coder for 8-bit alphabets", "description": "Fast vectorized (SSE 4.1) range coder for 8-bit alphabets - GitHub - richgel999/sserangecoding: Fast vectorized (SSE 4.1) range coder for 8-bit alphabets", "urlToImage": "https://opengraph.githubassets.com/0f8269bcdf7d90c289c6a1f1328bde69d916ebc81682b4f25194137ec3007d7c/richgel999/sserangecoding"}, {"title": "WWDC 2023 Includes Swift Student Challenge, Some Winners Able to Attend Apple Park Special Event", "description": "Apple today announced the WWDC 2023 event, which is set to be held from June 5 to June 9. Alongside the announcement, Apple began accepting submissions for the annual Swift Student Challenge, which tasks students with creating an innovative coding project usi…", "urlToImage": "https://images.macrumors.com/t/qDXZhj1LnNNp0Ru4pnJuc6LKbHQ=/1700x/article-new/2023/03/swift-student-challenge.jpg"}, {"title": "Apple’s WWDC 2023 keynote will take place on June 5", "description": "In addition to iOS 17 and macOS 14, Apple could announce its XR platform.", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/WWDC-2023-760x380.png"}, {"title": "Top 7 Programming Languages To Develop Native Android Apps", "description": "We spend our lives on our smartphones for purposes like communicating with our near and dear ones, researching different items, binge-watching, etc. This has led to the use of smartphones growing to a huge extent. Research suggests that the number of smartpho…", "urlToImage": "https://readwrite.com/wp-content/uploads/2023/02/Programming-Languages.jpg"}, {"title": "Don't Miss This Webinar! - Coding in the Age of AI", "description": "On Wednesday I passed along a great resource that Gary Stager shared with me. Today, I have another announcement from Gary that you should note right now. That is a free webinar he's hosting on April 27th. Coding in the Age of AI is a two-hour, hands-on webin…", "urlToImage": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiV5OG-1ksnTDJZ9RFJyX79NpPvQJiBwygZ2qcMi1ugtAeZn7eS8REHRXlrz13mfSybOVJRaPYJWwDOux7mVUGzdbqZ-WZ_tSsPHEiwouMn4nSwGYYgf8R_WJR_UUajdS5TchntckQgUP0faGRqW7lNTQCVfHS2do_sGrNvUg8IWRyVws4cAzeFwLcuyg/w1200-h630-p-k-no-nu/anatomy-1751201_640.png"}, {"title": "Google Bard Adds Coding Capabilities via @sejournal, @MattGSouthern", "description": "Google expands Bard's capabilities to include support for programming tasks in 20+ languages and debugging assistance.\nThe post Google Bard Adds Coding Capabilities appeared first on Search Engine Journal.", "urlToImage": "https://www.searchenginejournal.com/wp-content/uploads/2023/04/google-bard-coding-644282f27c8da-sej.png"}, {"title": "A Serial Tech Investment Scammer Takes Up Coding?", "description": "John Clifton Davies, a 60-year-old con man from the United Kingdom who fled the country in 2015 before being sentenced to 12 years in prison for fraud, has enjoyed a successful life abroad swindling technology startups by pretending to be a billionaire invest…", "urlToImage": "https://krebsonsecurity.com/wp-content/uploads/2023/03/codestoyouteam.png"}, {"title": "Amazon's new AI coding tool has one HUGE advantage over Microsoft's GitHub Copilot", "description": "GitHub Copilot has a real competitor on the way in Amazon CodeWhisperer which has one HUGE advantage over it.", "urlToImage": "https://cdn.mos.cms.futurecdn.net/V8vAqYCKk863LjjfnZsk9T-1200-80.jpg"}, {"title": "ChatGPT Creates Mostly Insecure Code, But Won't Tell You Unless You Ask", "description": "ChatGPT, OpenAI's large language model for chatbots, not only produces mostly insecure code but also fails to alert users to its inadequacies despite being capable of pointing out its shortcomings. The Register reports: Amid the frenzy of academic interest in…", "urlToImage": "https://a.fsdn.com/sd/topics/ai_64.png"}, {"title": "Developers embrace AI Tools but face ‘Big Code’ challenges, survey finds", "description": "A new report from Sourcegraph warns Big Code will hit crisis mode if companies don't get a handle on how their developers use AI at work.", "urlToImage": "https://venturebeat.com/wp-content/uploads/2023/04/Screenshot-2023-04-27-at-1.35.41-AM-e1682604857405.png?w=1200&strip=all"}, {"title": "Goldman Sachs was fined $3 million after it mixed up millions of 'short' sale orders as 'long.' The culprit was one missing line of code.", "description": "Goldman had \"inadvertently failed\" to include a single line of computer code during an upgrade to its automated trading software, per a Finra filing.", "urlToImage": "https://i.insider.com/6280c56e9147a30018b47be9?width=1200&format=jpeg"}, {"title": "Stability AI Launches StableLM, an Open Source ChatGPT Alternative", "description": "An anonymous reader quotes a report from Ars Technica: On Wednesday, Stability AI released a new family of open source AI language models called StableLM. Stability hopes to repeat the catalyzing effects of its Stable Diffusion open source image synthesis mod…", "urlToImage": "https://a.fsdn.com/sd/topics/ai_64.png"}, {"title": "Amazon, Meta, and other tech giants are cutting middle management to be more efficient. It's a risky move that could backfire.", "description": "As Meta, Amazon, Salesforce and other tech firms prioritize efficiency, they're cutting out middle management. Experts say it's not so simple.", "urlToImage": "https://i.insider.com/63348f62ed5b4f00183ba7b4?width=1200&format=jpeg"}, {"title": "An outsourcing firm cut dozens of contractors who were training the language model behind OpenAI's ChatGPT", "description": "Invisible laid off 31 contractors, known as \"advanced AI data trainers,\" who helped train OpenAI's technology to be more accurate.", "urlToImage": "https://i.insider.com/6435c3e6ca216e0018211c9c?width=1200&format=jpeg"}, {"title": "Elon Musk appears to offer $1 million bounty to 'convict' those responsible for Twitter 'botnets'", "description": "A Twitter user identified negative feedback loops affecting \"reputation scores,\" and another claimed this was how \"botnets\" suppress certain accounts.", "urlToImage": "https://i.insider.com/6361bf3bade71a00193dec43?width=1200&format=jpeg"}, {"title": "Modern Dance or Full-Body Keyboard? Why Not Both!", "description": "If you felt in your heart that Hackaday was a place that would forever be free from projects that require extensive choreography to pull off, we’re sorry to disappoint you. Because you’…", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/03/semaphore.png"}, {"title": "Could 1080p Video Output From The RP2040 Be Possible?", "description": "Modern microcontrollers often have specs comparable with or exceeding early gaming consoles. However, where they tend to fall short is in the video department, due to their lack of dedicated …read more", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/03/Can-the-RP2040-output-1080p_-I-think-so-with-a-little-help.-2-40-screenshot.png"}, {"title": "Closing in on the “Perfect Code”", "description": "Turbo codes, which let engineers pump far more error-free data through a channel, will be the key to the next generation of multimedia cellphones", "urlToImage": "https://spectrum.ieee.org/media-library/french-connection-turbo-codes-inventors-claude-berrou-left-and-alain-glavieux-both-professors-at-the-ecole-nationale-superieu.jpg?id=26770990&width=1200&height=600&coordinates=0%2C127%2C0%2C128"}, {"title": "'Better Drugs, Better Health': A Human Genome Pioneer Talks About the Future of Genetics", "description": "Twenty years ago, the Human Genome Project officially wrapped up. It was a feat of collaborative science that took 13 years—from 1990 to 2003—and involved researchers from around the globe.Read more...", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/a819875134966b3f62a5d15f48a5fe66.jpg"}, {"title": "Plastic and stimulus-specific coding of salient events in the central amygdala", "description": "Neurons in the central amygdala contribute to the reward prediction error responses of dopamine neurons to facilitate reward learning, but are not involved in aversive learning.", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-05910-2/MediaObjects/41586_2023_5910_Fig1_HTML.png"}, {"title": "A Trick to Reaching Flow", "description": "Tips for developers on getting into flow states", "urlToImage": "http://static1.squarespace.com/static/63d99fd7b81c80165cd55eda/t/64277fa0d007b561deb6c52b/1680310180323/unsplash-image-US06QF_sxu8.jpg?format=1500w"}, {"title": "You can now use Bard for coding or help with Google Sheets functions", "description": "A new update has come to Google's Bard. The AI chatbot can now help with coding or creating functions in Google Sheets.", "urlToImage": "https://www.androidauthority.com/wp-content/uploads/2020/01/google-logo-G-at-ces-20201.jpg"}, {"title": "Bard gets a little smarter as Google adds some PaLM upgrades", "description": "Google has started to bring in new improvements to its AI chatbot Bard via PaLM.", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QqeWJydaaHymRMU6JxxNHo-1200-80.jpg"}, {"title": "Yellow AI launches dynamic automation platform powered by generative AI for enterprises", "description": "Yellow AI today launched its Dynamic Automation Platform (DAP) to automate customer and employee experiences across channels.", "urlToImage": "https://venturebeat.com/wp-content/uploads/2022/03/GettyImages-1169246375-e1682431460287.jpg?w=1200&strip=all"}, {"title": "MSU x Pathlight Belize Coding Club 2022", "description": "Adafruit is nothing without our community! We’d like to thank Laura for sharing the incredible work being done at Michigan State University.From Laura:There are photos of us using micro:bits with students in Belize last summer in our blog (https://msu-pathlig…", "urlToImage": "https://s0.wp.com/i/blank.jpg"}, {"title": "Kids’ coding languages", "description": "Programming is becoming an increasingly useful skill in today’s society. As we continue to rely more and more on software and digital technology, knowing how to code is also more and more valuable. That’s why many parents are looking for ways to introduce the…", "urlToImage": "https://www.raspberrypi.org/app/uploads/2023/01/dsc_0042_24987365617_o-500x333.jpg"}, {"title": "I've been laid off 4 times in a row from tech companies like Uber and Reddit. Here's what I did to get back on my feet.", "description": "Janet Anne Panen considers herself a veteran when it comes to layoffs and says you have to be really shameless about using your network.", "urlToImage": "https://i.insider.com/637860cb2c8b9a0018cbc2e5?width=1200&format=jpeg"}, {"title": "Wolverine Gives Your Python Scripts The Ability To Self-Heal", "description": "[BioBootloader] combined Python and a hefty dose of of AI for a fascinating proof of concept: self-healing Python scripts. He shows things working in a video, embedded below the break, but we&#8217…", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/03/AIcoding.jpg"}, {"title": "ChatGPT just created malware, and that’s seriously scary", "description": "A self-professed programming novice has reported to create a powerful data-mining malware using just ChatGPT prompts, all within a span of a few hours.", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/04/ChatGPT-MacBook-Pro-Hatice-Baran-1.jpg?resize=1200%2C630&p=1"}, {"title": "AI-Powered assistance for designers: Tacoball iPhone and Apple Watch game creation process", "description": "AI-Powered assistance for designers: Tacoball iPhone and Apple Watch game creation process\n \n\n abduzeedo0417—23\n In the age of digital design, professionals are continually seeking innovative tools to streamline their workflow and enhance the creative process…", "urlToImage": null}, {"title": "Eww: Programmable Widgets for Linux", "description": "ElKowars wacky widgets. Contribute to elkowar/eww development by creating an account on GitHub.", "urlToImage": "https://repository-images.githubusercontent.com/296943592/2d93f61c-7d62-4923-842d-7ed1ab877aaf"}, {"title": "New ways to manage your data in ChatGPT", "description": "ChatGPT users can now turn off chat history, allowing you to choose which conversations can be used to train our models.", "urlToImage": "https://openaicom.imgix.net/b78937ac-9ede-459f-80ab-db50f4f4622a/new-ways-to-manage-your-data-in-chatgpt.png?auto=compress%2Cformat&fit=min&fm=jpg&q=80&rect=0%2C0%2C2048%2C2048"}, {"title": "DeepMind's CEO said there's a chance that AI could become self-aware in the future", "description": "The CEO of Alphabet-owned AI lab, DeepMind Technologies, spoke about the future potential of artificial intelligence in an interview with CBS.", "urlToImage": "https://i.insider.com/643d1e3e7cdf0f00185ccfea?width=1200&format=jpeg"}, {"title": "Team steers students through murky waters of ChatGPT coding", "description": "West Virginia University researchers are preparing high school seniors and college students to harness the power of ChatGPT, the popular artificial intelligence chatbot, through coding while addressing the platform's potential shortcomings.", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/wvu-research-team-stee.jpg"}, {"title": "Google Bard is Switching To a More 'Capable' Language Model, CEO Confirms", "description": "People haven't exactly been impressed in the short time since Google released its \"experimental conversational AI service\" Bard. Coming up against OpenAI's ChatGPT and Microsoft's Bing Chat (also powered by OpenAI's GPT-4) users have found its responses to no…", "urlToImage": "https://a.fsdn.com/sd/topics/topicgoogle_fb.gif"}, {"title": "Google Partners With AI Startup Replit To Take on Microsoft's GitHub", "description": "Alphabet's Google is striking a partnership to combine its artificial intelligence language models with software from startup Replit that helps computer programmers write code, a bid to compete with a similar product from Microsoft's GitHub and OpenAI. From a…", "urlToImage": "https://a.fsdn.com/sd/topics/ai_64.png"}, {"title": "Apple announces Swift Student Challenge for WWDC 2023", "description": "Alongside Apple's date reveal for WWDC 2023, the company has also announced that the Swift Student Challenge coding competition is making a return. Here's how to apply.New Swift Student ChallengeThis year's Worldwide Developer's Conference is set from June 5 …", "urlToImage": "https://photos5.appleinsider.com/gallery/53719-108015-swift-challenge-2023-xl.jpg"}, {"title": "This new ChatGPT iPhone shortcut is a game-changer", "description": "OpenAI’s ChatGPT changed how we interact with our devices. Whether you have a question, want to check if your coding is correct, or whatever else …\nThe post This new ChatGPT iPhone shortcut is a game-changer appeared first on BGR.", "urlToImage": "https://bgr.com/wp-content/uploads/2023/04/iphone-s-chatgpt-bgr.jpg?quality=82&strip=all"}, {"title": "Google Has A New Page For Bard Chatbot Updates via @sejournal, @MattGSouthern", "description": "Stay informed about Bard's latest features with Google's new experiment updates page. \nThe post Google Has A New Page For Bard Chatbot Updates appeared first on Search Engine Journal.", "urlToImage": "https://www.searchenginejournal.com/wp-content/uploads/2023/04/google-bard-updates-1-64359bf268f28-sej.png"}, {"title": "Google's AI Chatbot Can Now Help You Code - CNET", "description": "Bard can help write and debug code. But Google warns the AI tool won't always get it right.", "urlToImage": "https://www.cnet.com/a/img/resize/3dc199e07b1912476bddcc20c46dd1014c231e86/hub/2023/04/21/7879b2f7-6c5c-4989-b719-a72a76d8f8be/gettyimages-1179602916.jpg?auto=webp&fit=crop&height=630&width=1200"}, {"title": "Stability AI launches StableLM, an open source ChatGPT alternative", "description": "StableLM's 3B and 7B models are available now on GitHub under CC 4.0 license.", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/04/stochasitc_parrot_hero_4-760x380.jpg"}, {"title": "Show HN: Hocus – self-hosted alternative to GitHub Codespaces using Firecracker", "description": " Spin up ready-to-code, disposable dev environments on your own servers. Self-hosted alternative to Gitpod and Github Codespaces. - GitHub - hocus-dev/hocus:  Spin up ready-to-code, disposable de...", "urlToImage": "https://opengraph.githubassets.com/0d8b1e9e9f6ad3e7e8a00d62695cea2786a7d4757cfca66357524c4d912f521b/hocus-dev/hocus"}, {"title": "The future of programming: Research at CHI 2023", "description": "Research on programming tools published at CHI 2023.", "urlToImage": "https://austinhenley.com/blog/images/academicconference.png"}, {"title": "Google is apparently rushing forward with AI-powered Search amid Microsoft threat", "description": "Google is reportedly concerned about Samsung's plan to replace Google Search as the default search engine on its smartphones.", "urlToImage": "https://cdn.mos.cms.futurecdn.net/M6HFoKyPCZeGYFyfkYRK5n-1200-80.jpg"}, {"title": "Artificial intelligence: 5 questions answered that you should know", "description": "What actually is a neural network and are AIs conscious? Here are five important questions about artificial intelligence answered", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2023/04/18121418/SEI_151943746.jpg"}, {"title": "Google chief warns AI could be harmful if deployed wrongly", "description": "Sundar Pichai calls for global regulatory framework similar to nuclear treaty amid safety concernsGoogle’s chief executive has said concerns about artificial intelligence keep him awake at night and that the technology can be “very harmful” if deployed wrongl…", "urlToImage": "https://i.guim.co.uk/img/media/1685d2b2d8e36e30fd0ff09a6b23474f54081a62/0_205_4500_2700/master/4500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=753edea9c93661a3171d279ee1465bde"}, {"title": "Link Pack", "description": "Almost over you by Önnu Jónu Son aka Haraldur Thorleifsson, founder of Ueno. – How to help young people limit screen time — and feel better about how they look. (I see my 16 year old try to come up with all kinds of solutions to limit her screen time on her o…", "urlToImage": "https://s0.wp.com/i/blank.jpg"}, {"title": "Open Sourcing Cody – Sourcegraph's AI-enabled editor assistant", "description": "Cody, Sourcegraph's AI-enabled editor assistant, is now open source", "urlToImage": "https://storage.googleapis.com/sourcegraph-assets/blog/cody-hero.png"}, {"title": "I used ChatGPT to build a simple Chrome extension in 10 hours. Here's how I sold it for thousands on Acquire and what I learned about my fastest launch-to-exit ever.", "description": "Ihor Stefurak isn't a programmer and didn't know how to write code. So he asked ChatGPT to help him.", "urlToImage": "https://i.insider.com/643f05caae06160018a2e212?width=1200&format=jpeg"}, {"title": "My advice to my children about college sounds nothing like my parents' advice to me", "description": "I was raised to believe that if I got a degree — any degree — I'd have a secure, well-paying job and that it would be worth the cost.", "urlToImage": "https://i.insider.com/6345c870d2050f0011d3d8fa?width=1200&format=jpeg"}, {"title": "Strava fitness app now works with Spotify in its latest update", "description": "Strava, the popular fitness tracker for iPhone and Apple Watch, is rolling out a major update to its app this week. Starting today, users will be able to interact with Spotify songs directly from Strava without having to leave the app.\n more…\nThe post Strava …", "urlToImage": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2023/04/Strava-Spotify.png?resize=1200%2C628&quality=82&strip=all&ssl=1"}, {"title": "'What someone does with their free time has no business being discussed or judged in the workplace': Boss refuses to hire qualified employee because she is a gamer, internet is furious", "description": "Gamers tends to have a bad reputation. The boomers simply see the kids that would be glued to the video games and procrastinate doing their homework and never go outside. So when they hear an adult say that they are a \"gamer,\" many think that this is a person…", "urlToImage": "https://i.chzbgr.com/thumb1200/19902213/hDADA3B28/boomer-boss-gamers-hiring-gamer-problems-managers-boomer-managers-toxic-work-environment-19902213"}, {"title": "The Python Coding Blog: The Python Coding Programme: A Live Course for Beginners With Small Cohorts & Active Mentoring", "description": "The Python Coding Programme launches today. It's a live course for beginners with small cohorts and active mentoring", "urlToImage": "https://i0.wp.com/thepythoncodingbook.com/wp-content/uploads/2023/03/The-Python-Coding-Programme.png?fit=1584%2C396&ssl=1"}, {"title": "The Mystery Of The Human Genome's Dark Matter", "description": "Twenty years ago, an enormous scientific effort revealed that the human genome contains 20,000 protein-coding genes, but they account for just 2% of our DNA. The rest of was written off as junk – but we are now realising it has a crucial role to play.", "urlToImage": "https://ychef.files.bbci.co.uk/live/624x351/p0fg1p38.jpg"}, {"title": "Benefits of a Project-Product Management Mindset for Government Digital Transformation", "description": "Speed or accuracy? Which is more important to a government agency during digital transformation? Focus on speed, and something could be missed. Focus on accuracy only, and the solution you need might be outdated by the time it’s completed. When you have limit…", "urlToImage": "https://readwrite.com/wp-content/uploads/2023/03/Government-Digital-Transformation.jpg"}, {"title": "AI vs. AGI vs. Consciousness vs. Super-Intelligence vs. Agency", "description": "GPT-4 surpasses all sane definitions of “Artificial General Intelligence.” AI (without the “G”) is a fancy way of saying machine learning - finding", "urlToImage": null}, {"title": "Stability AI Launches the First of Its StableLM Suite of Language Models", "description": "Stability AI's open-source Alpha version of StableLM showcases the power of small, efficient models that can generate high-performing text and code locally on personal devices. Discover how StableLM can drive innovation and open up new economic opportunities …", "urlToImage": "http://static1.squarespace.com/static/6213c340453c3f502425776e/62f2452bc121595f4d87c713/643fad5f752bbf4f79e757d3/1681918280648/A+stochastic+Parrot%2C+flat+design%2C+vector+art+x4.png?format=1500w"}, {"title": "How to learn and study in the UK at low (or no) cost", "description": "From accessing free online courses worldwide to the local library, there are plenty of optionsBooks, tutors, study tools, materials … the prices all add up. Whether you are a student at school, college or university or hoping to swot up on a topic independent…", "urlToImage": "https://i.guim.co.uk/img/media/14ddb93e62fc7242033da532decdbaf1c99187d7/0_0_5000_3000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8bd130fae36c0047c0f5ba26e9d0e112"}, {"title": "Is coding a good career?", "description": "A coding career has the potential to be exciting and lucrative, but there are some important caveats to consider.", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dwuYJqsu8X8TLxV8HGv696-1200-80.jpg"}, {"title": "How generative AI is changing the way developers work", "description": "Rapid advancements in generative AI coding tools like GitHub Copilot are accelerating the next wave of software development. Here’s what you need to know.", "urlToImage": "https://github.blog/wp-content/uploads/2023/04/1200.630-Global.png"}, {"title": "Apple opens Swift Student Challenge for WWDC 2023", "description": "Apple has announced WWDC 2023 today and with that, it’s opened the annual Swift Student Challenge. Prizes will include exclusive WWDC23 outerwear, AirPods Pro, a customized pin set, a one-year membership to the Apple Developer Program, and a chance to attend …", "urlToImage": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2023/03/swift-student-challenge-2023.jpeg?resize=1200%2C628&quality=82&strip=all&ssl=1"}, {"title": "8 ChatGPT Side Gigs: Are They Legit Money-Making Opportunities?", "description": "Are ChatGPT side gigs legitimate, or just another overhyped scam? We uncover the truth behind these money-making opportunities.", "urlToImage": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/03/cchatgpt-on-laptop.jpg"}, {"title": "Google’s ChatGPT competitor Bard now has a changelog; here’s what’s new", "description": "Bard now has a new experiment updates section listing the latest upgrades", "urlToImage": "https://static1.anpoimages.com/wordpress/wp-content/uploads/2023/03/how-to-use-google-bard-hero.jpg"}, {"title": "How to Set Up Python for Development on WSL", "description": "Get started with cross-platform Python programming by setting up Python on the Windows Subsystem for Linux.", "urlToImage": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/04/hands-typing-on-laptop-with-python-book.jpg"}, {"title": "Sharpen Your JavaScript Skills With These 9 Fun Game Project Tutorial Videos", "description": "By building these fun game projects, you can make programming less tedious and also hone your skills at the same time.", "urlToImage": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/03/man-playing-super-mario.jpg"}, {"title": "Former Students Are Suing For-Profit Coding Bootcamp BloomTech", "description": "Former students of the bootcamp are claiming it misrepresented employment and earnings statistics.", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/642350a81086f9421dc2b451/0x0.jpg?format=jpg&width=1200"}, {"title": "I used ChatGPT to talk to my boss for a week and she didn't notice. Here are the other ways I use it daily to get work done.", "description": "Nick Rolle says he was unsure at first if he should tell his team that he was using ChatGPT. Now, he uses it daily to check code and write messages.", "urlToImage": "https://i.insider.com/64494e9c9052390019700116?width=1200&format=jpeg"}, {"title": "Xiaomi 13T Pro Appears Online, Might Launch as Redmi Phone in China", "description": "With the launch of the Xiaomi 13 series a while back, it was only a matter of time before we saw even more Xiaomi 13 variants out in the wild.", "urlToImage": null}, {"title": "Studying the stomach contents of spiders shows how they help control crop pests", "description": "On farms, spiders are important predators who control insect populations, including pests that can damage crops.", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/studying-the-stomach-c.jpg"}, {"title": "The 'mammoth meatball' grown in a lab probably doesn't taste like woolly mammoth at all", "description": "Lab-grown meat startup Vow used a gene from mammoth DNA identical to one in Asian elephants. But their meatball doesn't taste like woolly mammoth.", "urlToImage": "https://i.insider.com/64346aa2197c2d00192be291?width=1200&format=jpeg"}, {"title": "What coding language should I learn?", "description": "There are many different coding languages to choose from. Find out which language is best for you.", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qC3t7tWA4mMoYwSWow9Y7H-1200-80.jpg"}, {"title": "Google updates Bard to better answer math and logic questions, coding coming soon", "description": "To date, Bard has used Google’s LaMDA (Language Model for Dialogue Applications) model focused on conversational dialogue, and it’s now incorporating PaLM (Pathways Language Model) for improved math and logic capabilities, with “coding coming soon.”\n more…\nTh…", "urlToImage": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2023/03/google-bard-logo-circle-2.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1"}, {"title": "Time-varying orbital angular momentum generated by a metasurface", "description": "The orbital angular momentum (OAM) of electromagnetic waves—a kind of \"structured light\"—is associated with a helical or twisted wavefront.", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/time-varying-orbital-a.jpg"}, {"title": "Score Babbel Language Learning for under $150 before time runs out", "description": "Macworld\n\n\n\r\n\n\n\n\nWhen great deals on name brands come up, you’ve got to move fast…because who knows when an opportunity that good will come around again.\r\n\n\n\n\nWhen it comes to language learning (and we don’t mean coding languages), few brand names shine as br…", "urlToImage": "https://www.macworld.com/wp-content/uploads/2023/04/Macworld-Babbel-Language-Learning-Lifetime-Subscription-All-Languages.jpeg?quality=50&strip=all&w=1024"}, {"title": "How AI coding companions will change the way developers work", "description": "Developer tools are one area where generative AI is already having a tangible impact on productivity and speed, and it's the reason I'm excited about Amazon CodeWhisperer.", "urlToImage": "https://www.allthingsdistributed.com/images/wvhomework.jpg"}, {"title": "‘Grim outlook’ as criminals commandeer AI chatbots, Europol says", "description": "Europol this week issued a stark warning highlighting the risks posed by criminals as  they get to grips with the new wave of advanced AI chatbots.", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/01/ChatGPT-OpenAI-logo.jpg?resize=1200%2C630&p=1"}, {"title": "Developer Tools 2.0", "description": "Generative AI stands to change how work happens in one industry after another. But software engineering’s transformation isn’t done yet.", "urlToImage": "https://www.sequoiacap.com/wp-content/uploads/sites/6/2023/03/Copilot-Final-Wide-01.jpg"}, {"title": "The 8 Most Popular Backend Frameworks for Web Development", "description": "Want to choose a backend framework for your application? Make sure you select the right one.", "urlToImage": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/04/djnago-book-kept-on-the-desk.jpg"}, {"title": "ChatGPT vs. Google Bard: Which gives the better answers?", "description": "Google’s language model is still in its early stages", "urlToImage": "https://static1.anpoimages.com/wordpress/wp-content/uploads/2023/03/how-to-use-google-bard-hero.jpg"}, {"title": "How to Use the Do-While Loop in Excel VBA", "description": "Want to automate repetitive tasks in Excel VBA? Learn how to use the Do-While loop to execute a set of actions repeatedly until a condition is met.", "urlToImage": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/03/do-while-loops-in-excel-vba.jpg"}, {"title": "Photo Picker Everywhere", "description": "The photo picker is a browsable interface that presents the user with their media library, sorted by date from newest to oldest, and integrates nicely", "urlToImage": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgqK6_CuzuTclBjY9yZlEq0U5GfVahyrXNgGbW8RfC6ZVhfuEh37k65VDUXlm--6EBlkjMra24QcCNRhCB8E3G6NFtxH61p2lGxP1IwzCXLhPi_o_7q_q7u1J76WjU9Ent5vMuq5FXIl7iuPDX1Jq8xnX-PD1zRt17NPKCgINiQX3sSbJsJOJaD_182/s1600/Extending%20the%20Android%20SDK%20.png"}, {"title": "Arts, crafts, egg hunts, gardens galore … great UK Easter day trips", "description": "From woodland strolls in search of early bluebells to egg hunts, storytelling and sculpture parks, here’s our pick of the best outingsAll five RHS gardens have giant egg hunts among the April blooms, from delicate violets and alpine pear blossom at Rosemoor i…", "urlToImage": "https://i.guim.co.uk/img/media/1fc5af16a998594284a51f6111da8fac80d9efc8/0_248_7360_4417/master/7360.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=08047796636bf901c723105855f82ae1"}, {"title": "Clubs Conference 2023: Ideas and tools for CoderDojos and Code Clubs", "description": "On 24 and 25 March, more than 140 members of the Code Club and CoderDojo communities joined us in Cambridge for our first-ever Clubs Conference. At the Clubs Conference, volunteers and educators came together to celebrate their achievements and explore new wa…", "urlToImage": "https://www.raspberrypi.org/app/uploads/2023/04/Clubs-Conference-10-500x333.jpg"}, {"title": "15 Lessons from 15 Years of Blogging", "description": "Posted: 4/2/23 | April 2nd, 2023 Today is a big day. It marks fifteen years running this website. I posted my first blog entry in early April 2008, after spending over a month bugging friends I met in Vietnam for help with coding. Back then, in the days befor…", "urlToImage": "https://www.nomadicmatt.com/wp-content/uploads/2023/04/newmatt15.jpeg"}]